openFoam/flow_over_flatplate/turbulent/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          385;
        startFace       418720;
    }
    outlet
    {
        type            patch;
        nFaces          385;
        startFace       419105;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          545;
        startFace       419490;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          449;
        startFace       420035;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          96;
        startFace       420484;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          419650;
        startFace       420580;
    }
)

// ************************************************************************* //
